app/views/profiles/show.html.erb

SELECT "boats"."id" FROM "boats" WHERE "boats"."profile_id" = ?  [["profile_id", 1]]
---

<% @current_user.boats.each do |b| %>