app/views/jobs/claimed_jobs.html.erb

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT 1  [["id", 3]]
---
  <tr>
    <td><%= phelper(Boat.find(j.boat_id).boat_name) %></td>