app/controllers/boats_controller.rb

SELECT "boats".* FROM "boats"
---
  def index
    @boats = Boat.all

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
  def show
    @boat = Boat.find(params[:id])
    @boat_jobs = @boat.jobs
    @current_user = User.find(current_user.id)

INSERT INTO "boats" ("boat_name", "container_capacity", "location", "profile_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["boat_name", "1"], ["container_capacity", 1], ["location", "1"], ["profile_id", 1], ["created_at", "2016-03-10 16:09:31.777520"], ["updated_at", "2016-03-10 16:09:31.777520"]]
---
  def create
    @current_profile = Profile.find(current_user.id)
    @new_boat = Boat.new(boat_params)
    @new_boat.user_id = current_user.id

    if @new_boat.save

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @boat = Boat.find(params[:id])

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "boats" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "boats"."id" = ?  [["avatar_file_name", "surf.jpg"], ["avatar_file_size", 5398538], ["avatar_updated_at", "2016-03-17 16:59:57.977181"], ["updated_at", "2016-03-17 17:00:00.039314"], ["id", 22]]
---
  def update
    @boat = Boat.find(params[:id])
    @boat.update(boat_params)

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "boats" WHERE "boats"."id" = ?  [["id", 7]]
---
  def destroy
    @boat = Boat.find(params[:id])
    @boat.destroy