app/controllers/jobs_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "boats".* FROM "boats" WHERE (2) LIMIT 1
SELECT "boats".* FROM "boats" WHERE "boats"."user_id" = ?  [["user_id", 3]]
---
  def find_jobs
    @current_profile = Profile.find(current_user.id)

    @jobs = Job.all
    @new_job = Job.new

    @boat = Boat.all
    @new_boat = Boat.new
    @boats = Boat.where(user_id: @current_profile.id)