app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]
SELECT "boats"."id" FROM "boats" WHERE "boats"."profile_id" = ?  [["profile_id", 1]]
---
  def show
    # @profile = Profile.current_user
    @current_profile = Profile.find(current_user.id)
    @current_user = User.find(current_user.id)
    @boats = Boat.all

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 3]]
---
  def update
    @profile = Profile.find(params[:id])