app/controllers/profiles_controller.rb

  def index

    Profile.new(params[:user_id])
    @current_profile = Profile.find(current_user.id)
    @current_user = User.find(current_user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def show

    # @current_profile = Profile.find(current_user.id)
    @current_user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def new
    @current_profile = Profile.find(current_user.id)
    @current_user = User.find(current_user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]

  def edit
    @current_profile = Profile.find(current_user.id)
    @current_user = User.find(current_user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]