app/controllers/relationships_controller.rb

SELECT  "boats".* FROM "boats" WHERE "boats"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
---
  def create
    @boat = Boat.find(current_boat.id])
    @user = User.find(current_user.id)